In [2]:
import sqlite3

conn = sqlite3.connect('test.db')
print("Opened Database Sucessfully")
conn.execute('''CREATE TABLE CLASS1
(ID INT PRIMARY KEY NOT NULL,
NAME TEXT NOT NULL,
AGE INT NOT NULL,
ADDRESS CHAR(50),
SALARY REAL);''')

print("Table Created Sucessfully")

Opened Database Sucessfully
Table Created Sucessfully

In [3]:
conn.execute("INSERT INTO CLASS1 (ID,NAME,AGE,ADDRESS,SALARY)\
VALUES (25,'Nilesh','22','Mumbai',200000.00)");

conn.execute("INSERT INTO CLASS1 (ID,NAME,AGE,ADDRESS,SALARY)\
VALUES (23,'Abhishek','21','Pune',300000.00)");

conn.execute("INSERT INTO CLASS1 (ID,NAME,AGE,ADDRESS,SALARY)\
VALUES (35,'Spanden','20','New Delhi',400000.00)");

conn.execute("INSERT INTO CLASS1 (ID,NAME,AGE,ADDRESS,SALARY)\
VALUES (44,'Vijay','23','Chennai',500000.00)");

conn.commit()
print("Records Created Sucessfully")

Records Created Sucessfully

In [9]:
conn.execute('''CREATE TABLE CLASS2
(ID INT PRIMARY KEY NOT NULL,
AGE INT NOT NULL,
ADDRESS CHAR(50),
SALARY REAL);''')

print("Table Created Sucessfully")

Table Created Sucessfully

In [10]:
conn.execute("INSERT INTO CLASS2 (ID,AGE,ADDRESS,SALARY)\
VALUES (20,'22','Mumbai',200000.00)");

conn.execute("INSERT INTO CLASS2 (ID,AGE,ADDRESS,SALARY)\
VALUES (23,'21','Pune',300000.00)");

conn.execute("INSERT INTO CLASS2 (ID,AGE,ADDRESS,SALARY)\
VALUES (31,'20','New Delhi',400000.00)");

conn.execute("INSERT INTO CLASS2 (ID,AGE,ADDRESS,SALARY)\
VALUES (44,'23','Chennai',500000.00)");

conn.commit()
print("Records Created Sucessfully")

Records Created Sucessfully

In [12]:
cursor=conn.execute("SELECT NAME from CLASS1 INNER JOIN CLASS2 ON CLASS1.ID = CLASS2.ID")
for row in cursor:
    print("NAME=", row[0]), "\n"

print("INNER Join  Query Sucessfully")

NAME= Abhishek
NAME= Vijay
INNER Join  Query Sucessfully

In [ ]:
("SELECT NAME from CLASS1 LEFT JOIN CLASS2 ON CLASS1.ID = CLASS2.ID")